---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CompoundStructure
source: html/91f9b904-18cf-44eb-c4fe-66e9d038f156.htm
---
# CompoundStructure Members

Adds a new wall sweep or reveal to the compound structure.